snlkuharlocal/src/Catalogs/ЧекЛисты/ЧекЛисты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЧекЛисты</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияКоррекции</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТребованияКПаллете</name>
    <attributes>
      <name>ВидТребования</name>
      <type>
        <types>CatalogRef.ВидыТребованийКПаллете</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТребованияККоробу</name>
    <attributes>
      <name>ВидТребования</name>
      <type>
        <types>CatalogRef.ВидыТребованийККоробу</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТребованияКЕдинице</name>
    <attributes>
      <name>ВидТребования</name>
      <type>
        <types>CatalogRef.ВидыТребованийКЕдинице</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Enums/СостоянияКоррекции/СостоянияКоррекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияКоррекции</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
  </enumValues>
  <enumValues>
    <name>ПринятаЧастично</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Отработана</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ЧекЛисты/ObjectModule.bsl
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

//Кухарь 30.08.16 начало
Процедура ПередЗаписью(Отказ)
	Если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
		ЭтоСклад=истина;
	иначе
		ЭтоСклад=Ложь;
	КонецЕсли;
	
	
	
	НадоВыгружать = Ложь;
	Если ОбменДанными.Загрузка Тогда
		НадоВыгружать = Ложь;
	Иначе 
		НадоВыгружать = Истина;
		
		если ЭтоСклад тогда
			если ЭтоНовый() или Состояние=Перечисления.СостоянияКоррекции.Отклонена тогда
				Состояние=Перечисления.СостоянияКоррекции.ВРаботе;
			КонецЕсли;
		иначе
			если ЭтоНовый() тогда
				#Если клиент тогда
					Предупреждение("Создавать чек-листы можно только на складе.");
					Отказ=Истина;
				#Конецесли	
			КонецЕсли;
			
			
		КонецЕсли;
	КонецЕсли;	
		
		
		
		
		
		
		
		
		Если НадоВыгружать Тогда
			УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
		КонецЕсли;
		
		
	КонецПроцедуры


	Процедура ОбработкаЗаполнения(Основание)
		// Вставить содержимое обработчика.
	КонецПроцедуры
	//Кухарь 30.08.16 конец
